УТ_11_4.Umico/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="19c63914-92ce-4573-9a35-c1ea61e7a23d">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="11462406-65c5-4b89-a31f-928ff51b2b54">
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>UMC_НомерСчетаUmico</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UMC_ОплаченноБалламиUmico</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dc576429-9659-4271-8f29-a30c718d3b33">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="882e156f-fb1a-4dc4-9d8a-388e8f95f606">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b57e72ea-4f76-49bb-b2c7-3f553879edf9">
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="187168a5-e731-4f9c-93a1-dd5f5e17fde2">
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b3286257-e9bb-4f93-90a8-21c0293cdc0a">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="66818612-777d-457c-b18a-67c332762e56">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f151b0c4-5b99-473a-bbcc-23ab8ce8e168">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d44d98e3-37ca-40df-8743-d72b1a10ec8b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5d77c6ab-789c-44c3-9350-59d8b8a6b416">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КартыЛояльности</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5d4f5d05-9b50-4cd5-9dd8-bda1e1982dfa">
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c8ac9972-046a-4f8c-8d09-197179d41106">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f94b0d48-4bd4-4f12-90ae-dde9ee68ae74">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="e1b9633d-4d9f-451b-acee-56fc670affb3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7fcf83b9-397f-4e74-9332-c4f28a1c93aa">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b86d15a2-a07b-4e36-887b-9e1df1f11ff6">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cecdc85d-e5ea-4ec7-891a-7129fd0b769f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="5c19cff2-8ca9-490b-98d9-dfc7da90dad5">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cbaa2c69-bfcd-4f65-99da-6430a7f7e300">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bd9dc0b3-f984-4dcd-aae6-d33da978dc79">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="61f9fc6c-e97e-4cbb-8253-ccfdd2301a6f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="00a652bd-5301-4c87-a419-279bc11c177b">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bdbd66a1-8b92-432b-b1c9-89503249e182">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="e75c3382-5cf9-457f-a60c-6b7d2967a9fc">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="54daf256-8f9b-4a3f-8ac4-8a2a1c2ce18d">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="14f5e920-a8b9-4eca-9656-29370043383d">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="084ffede-c411-4e66-a196-cb49db10527b">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bc407389-7470-4040-899e-e5830e791665">
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СкладскиеПомещения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d6817206-55c3-40dd-b445-6fef11a58bc8">
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b96a2357-c2d0-4bb1-8161-fded35ecdaf8">
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e720dc89-faab-49d5-a027-c99498210b33">
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c41bcad7-04bb-4985-aed0-64b49289a271">
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="c4dd5022-6c57-4c84-b8c7-16fbb22c0977">
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="117ee2e5-3f7c-4005-8efa-9514d9d78296">
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="759fb9c5-f07f-4fe3-9a93-b32d516a17a6">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b05055a3-765b-47d9-9305-3799cea08c90">
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="2928c12f-96cd-405a-9d99-2bd4d1fde8a3">
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3eea9abb-6bd1-46ac-a6c7-0b36648d29e0">
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fb6038d6-6403-43c3-9a69-4fa09cc91b3f">
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9dad97c9-b3c8-4726-9f26-cb8a6dfc7e62">
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.БонусныеПрограммыЛояльности</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d7839726-5f51-44d1-9224-7e1815b35acf">
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="5ab89269-ea6e-48e4-8725-962cf850281c">
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="ccb05960-0b05-4ba9-aae5-2461d99eb01f">
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fdd081e1-37e3-414b-9993-d92075525f48">
    <name>АкцизныеМарки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ca06ef49-7aed-4a1c-8ab6-4037c20259fe">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="fafd444b-67ee-42fb-8643-1c2c39d6317b">
      <name>АкцизнаяМарка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="313dd1bd-6bf2-47b3-8a9c-a832b4c4e232">
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Справки2ЕГАИС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d2fd8ea6-6196-4ca9-8bd8-10fec609928f">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="a5990c66-0430-424d-9e65-c901526f7fad">
      <name>КодАкцизнойМарки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_11_4.Umico/src/Enums/UMC_ВариантыИспользованияПодключенияКUmico/UMC_ВариантыИспользованияПодключенияКUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>UMC_ВариантыИспользованияПодключенияКUmico</name>
  <enumValues>
    <name>ДляРозничныхПродаж</name>
  </enumValues>
  <enumValues>
    <name>ДляОптовыхПродаж</name>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Documents/ЧекККМВозврат/Forms/ФормаДокументаРМК/Module.bsl
#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("ИнформацияОбОплате")
&НаКлиентеНаСервереБезКонтекста
//@skip-check extension-variable-prefix
Функция UMC_ИнформацияОбОплате(Форма)

	ОплатаПлатежнымиКартамиОтменено = 0;
	Для Каждого СтрокаТЧ Из Форма.Объект.ОплатаПлатежнымиКартами Цикл
		Если СтрокаТЧ.ОплатаОтменена Тогда
			ОплатаПлатежнымиКартамиОтменено = ОплатаПлатежнымиКартамиОтменено + СтрокаТЧ.Сумма;
		КонецЕсли;
	КонецЦикла;

	Форма.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Форма.Объект.Товары, Форма.Объект.ЦенаВключаетНДС);

	Если Форма.Объект.ЦенаВключаетНДС Тогда
		СуммаБезСкидки = Форма.СуммаДокумента;
	Иначе
		СуммаБезСкидки = Форма.СуммаДокумента - Форма.Объект.Товары.Итог("СуммаНДС");
	КонецЕсли;

	ИнформацияОбОплате = Новый Структура;
	ИнформацияОбОплате.Вставить("Документ",               Форма.Объект.Ссылка);

	ИнформацияОбОплате.Вставить("Наличные",               Форма.Объект.ВыданоНаличными);
	ИнформацияОбОплате.Вставить("ПлатежныеКарты",         Форма.Объект.ОплатаПлатежнымиКартами.Итог("Сумма"));
	ИнформацияОбОплате.Вставить("ПлатежныеКартыОтменено", ОплатаПлатежнымиКартамиОтменено);
	ИнформацияОбОплате.Вставить("ПодарочныеСертификаты",  0);
	ИнформацияОбОплате.Вставить("БонусныеБаллы",          0);

	ИнформацияОбОплате.Вставить("СуммаДокумента",        Форма.СуммаДокумента);
	ИнформацияОбОплате.Вставить("СуммаКОплате",          СуммаБезСкидки);
	ИнформацияОбОплате.Вставить("СуммаСкидки",           0);
	ИнформацияОбОплате.Вставить("ИтогоОплачено",         ИнформацияОбОплате.Наличные + ОплатаПлатежнымиКартамиОтменено);

	ИнформацияОбОплате.Вставить("ДоступныеВидыОплаты", ДоступныеВидыОплаты(Форма));

	#Вставка
	ИнформацияОбОплате
	.Вставить("БаллыUmico", Форма.Объект.UMC_ОплаченноБалламиUmico);
	ИнформацияОбОплате.Вставить("ИтогоОплачено", ИнформацияОбОплате.Наличные + ОплатаПлатежнымиКартамиОтменено
		+ ИнформацияОбОплате.БаллыUmico);
	ИнформацияОбОплате.Вставить("СуммаКОплате", СуммаБезСкидки - ИнформацияОбОплате.БаллыUmico);
	
	Форма.ИнформационнаяПанельСуммаКВозвратуUmico = ИнформацияОбОплате.БаллыUmico;
	#КонецВставки

	Возврат ИнформацияОбОплате;

КонецФункции

// UMC пробить чек завершение.
// 
// Параметры:
//  Результат - Структура - Результат:
//  * ВыполненаОперацияНаУстройстве - Булево
//  * ИзмененныеДанныеЗаписаны - Булево
//  ДополнительныеПараметры  - Структура, Неопределено - Дополнительные параметры
&После("ПробитьЧекЗавершение")
&НаКлиенте
Процедура UMC_ПробитьЧекЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.ВыполненаОперацияНаУстройстве И Результат.ИзмененныеДанныеЗаписаны И ЗначениеЗаполнено(
		Объект.UMC_НомерСчетаUmico) Тогда

		UMC_ЗапуститьПередачуИнформацииОЧекеВUmico();	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура UMC_ЗапуститьПередачуИнформацииОЧекеВUmico()
	
	UMC_СтруктураОтвета = UMC_ПередатьИнформациюОЧекеВUmico();
	Если Не UMC_СтруктураОтвета.Результат Тогда
		UMC_ТекстСообщения = НСтр("ru = 'Не удалось передать сведения о документе в Umico. Повторить попытку?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("UMC_ПробитьЧекОшибкаЗавершение", ЭтотОбъект), UMC_ТекстСообщения,
			РежимДиалогаВопрос.ДаНет, 10);
	КонецЕсли;
	
КонецПроцедуры

// Передает информацию о чеке в Umico.
// 
// Возвращаемое значение:
//  Структура - UMC передать информацию о чеке в Umico:
// * Результат - Булево -
&НаСервере
Функция UMC_ПередатьИнформациюОЧекеВUmico()

	UMC_ОбработкаОбменаСUmico = Обработки.UMC_ОбменСUmico.Создать();
	UMC_ОбработкаОбменаСUmico.КассаККМ = Объект.КассаККМ;
	UMC_ОбработкаОбменаСUmico.ВариантИспользования = Перечисления.UMC_ВариантыИспользованияПодключенияКUmico.ДляРозничныхПродаж;

	Если UMC_ОбработкаОбменаСUmico.ОпределитьПараметрыПодключения() Тогда

		Возврат UMC_ОбработкаОбменаСUmico.ЗарегистрироватьЧек(Объект.Ссылка);

	КонецЕсли;

КонецФункции

// UMC пробить чек ошибка завершение.
// 
// Параметры:
//  Результат - КодВозвратаДиалога - Результат
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры
&НаКлиенте
Процедура UMC_ПробитьЧекОшибкаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		UMC_ЗапуститьПередачуИнформацииОЧекеВUmico();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
